from Sort1 import sort
from Sort2 import sort2
from Show import show
from Range import range

r=input("Виберіть режим роботи (виведення усіх даних, певного діапазону, сортування): ")
if r=='усі дані':
    show()

if r=='певний діапазон':
    v1=input('Введіть стовпець для пошуку: ')
    v2=input('Введіть мінімальне значення: ')
    v3=input('Введіть максимальне значення: ')
    range(v1,v2,v3)

if r=='сортування':
    k=input("Сортування потрібно виконати за 1 чи 2 стовпцями? ")
    if k=='1':
        n = input("Виберіть режим сортування (спадання,зростання):")
        l = input('Введіть назву стовпця за яким буде відбуватись сортування: ')
        sort(l,n)
    elif k=='2':
        n = input("Виберіть режим сортування (спадання,зростання):")
        l1 = input('Введіть назву першого стовпця за яким буде відбуватись сортування: ')
        l2 = input('Введіть назву другого стовпця за яким буде відбуватись сортування: ')
        sort2(l1,l2, n)
    else:
        print("Сортування за введеною кількістю полів відсутнє!")




